[
  {
    "id": "2733",
    "title": "Speedy Muscle Cars Jigsaw",
    "description": "Rev up your engines and piece together stunning images of powerful muscle cars! This free jigsaw puzzle game features 12 high-octane images of the world's most impressive speed machines. Select your challenge level—easy with 25 pieces for beginners, medium with 49 pieces for enthusiasts, or hard with 100 pieces for true puzzle masters. Whether you're a car lover or puzzle fanatic, this game delivers satisfying entertainment as you reconstruct these magnificent automotive beasts piece by piece!",
    "instructions": "Use your mouse to play the game or tap ob n the screen ",
    "url": "https://html5.gamemonetize.com/ox2ozu3ev3nh7xbfxsru94a1sys7y45n/",
    "categoryId": "puzzles",
    "tags": "Car, Fun, HTML5, Jigsaw, Kids, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/ox2ozu3ev3nh7xbfxsru94a1sys7y45n/512x384.jpg",
    "width": "960",
    "height": "540",
    "gameControls": [
      {
        "key": "Mouse Drag",
        "action": "Move and place puzzle pieces"
      },
      {
        "key": "Tap & Drag",
        "action": "Move and place puzzle pieces"
      }
    ]
  },
  {
    "id": "75439",
    "title": "Neon Directive",
    "description": "Experience the classic arcade thrill reborn with a stunning futuristic makeover! Master the art of bouncing, brick-shattering, and power-up unleashing across 30 uniquely designed levels. Unlock spectacular abilities like Multi-Ball mayhem and the mysterious Ghost Ball while enjoying buttery-smooth paddle controls for pixel-perfect precision. This modern take on the beloved brick-breaker genre is simple to learn but challenging to master. Plan your shots strategically, unleash spectacular combos, and climb to the top of the high score leaderboard!",
    "instructions": "Space Bar - Shoot Ball Arrow Keys - Move paddle left right",
    "url": "https://html5.gamemonetize.com/uld6tyf7inegdrqfnx6w34vj3jqdtzv2/",
    "categoryId": "hypercasual",
    "tags": "Arcade, Arkanoid, Bricks, Casual, destroy, Highscore, Hypercasual",
    "thumb": "https://img.gamemonetize.com/uld6tyf7inegdrqfnx6w34vj3jqdtzv2/512x384.jpg",
    "width": "1024",
    "height": "768",
    "gameControls": [
      {
        "key": "Arrow Left",
        "action": "Move paddle left"
      },
      {
        "key": "Arrow Right",
        "action": "Move paddle right"
      },
      {
        "key": "Space",
        "action": "Launch the ball"
      }
    ]
  },
  {
    "id": "31211",
    "title": "Advanced Car Parking 3D Simulator",
    "description": "Park like a pro in the sequel to the legendary mobile parking sensation! Advanced Car Parking 3D Simulator launches a new era of precision driving with jaw-dropping graphics, challenging multi-stage levels, and real-time online competition. Navigate tight spaces, master complex parking maneuvers, and overcome increasingly difficult obstacles. Whether you're perfecting parallel parking or conquering multi-level garages, this realistic simulation will transform you into a parking expert. Can you achieve perfect parking scores on every level?",
    "instructions": "Key Board Controls",
    "url": "https://html5.gamemonetize.com/82iagukj422w1jyinqs6g0oaombqgzti/",
    "categoryId": "racing",
    "tags": "1 Player, 3D, 3D Games, Best, Car, Cars, Color, drifting, Driving, Simulation, Simulator, Supercars, Unity3D",
    "thumb": "https://img.gamemonetize.com/82iagukj422w1jyinqs6g0oaombqgzti/512x384.jpg",
    "width": "800",
    "height": "600",
    "gameControls": [
      {
        "key": "W / Up Arrow",
        "action": "Accelerate"
      },
      {
        "key": "S / Down Arrow",
        "action": "Brake / Reverse"
      },
      {
        "key": "A / Left Arrow",
        "action": "Steer left"
      },
      {
        "key": "D / Right Arrow",
        "action": "Steer right"
      },
      {
        "key": "Space",
        "action": "Handbrake"
      }
    ]
  },
  {
    "id": "31603",
    "title": "Super Car Driving 2 Simulator 3D",
    "description": "Live out your racing dreams in the most advanced car simulator of its generation! Thanks to revolutionary real-physics engine technology, you'll experience authentic sports car handling like never before. Drift furiously through an entire open-world city with no traffic rules to hold you back—no police chases, just pure high-speed freedom! Execute illegal stunts, perform spectacular burnouts, and push your supercar to its absolute limits. The asphalt is yours to dominate in this ultimate driving playground!",
    "instructions": "Key Board Controls",
    "url": "https://html5.gamemonetize.com/wjf4268ogujdzr64wglv4se0kd8nhjdf/",
    "categoryId": "racing",
    "tags": "1 Player, 3D, 3D Games, Arcade, Best, Car, drift, drifting, Race, Racing, Simulation, Simulator, Stunts, Supercars, Unity3D",
    "thumb": "https://img.gamemonetize.com/wjf4268ogujdzr64wglv4se0kd8nhjdf/512x384.jpg",
    "width": "800",
    "height": "600",
    "gameControls": [
      {
        "key": "W / Up Arrow",
        "action": "Accelerate"
      },
      {
        "key": "S / Down Arrow",
        "action": "Brake / Reverse"
      },
      {
        "key": "A / Left Arrow",
        "action": "Turn left"
      },
      {
        "key": "D / Right Arrow",
        "action": "Turn right"
      },
      {
        "key": "Space",
        "action": "Handbrake / Drift"
      }
    ]
  },
  {
    "id": "44443",
    "title": "Bus Driving Amazing",
    "description": "Become a professional coach driver in the first authentic bus simulation that teaches you to navigate real routes across stunning European landscapes! Transport passengers between cities, showcase breathtaking scenic views, and master the art of handling massive coaches. With an expansive open-world map, incredible vehicle selection, and gorgeous interiors, you'll experience the most realistic bus driving adventure ever created. Enter the immersive world of professional transportation and drive through Europe like a true coach captain!",
    "instructions": "KeyBoard Controls",
    "url": "https://html5.gamemonetize.com/ear2s20frvn5pm9es6h9jtpbq63qjzmk/",
    "categoryId": "racing",
    "tags": ".io, .io Games, 1 Player, 3D, 3D Games, Action, Air, Boy, Boys, Collection, Creation, Decoration, Educational, Fashion, Girl, Girls, Interactive Fiction, IO, Mario, Minion, Relaxation, Unity3D",
    "thumb": "https://img.gamemonetize.com/ear2s20frvn5pm9es6h9jtpbq63qjzmk/512x384.jpg",
    "width": "800",
    "height": "600",
    "gameControls": [
      {
        "key": "W / Up Arrow",
        "action": "Accelerate"
      },
      {
        "key": "S / Down Arrow",
        "action": "Brake"
      },
      {
        "key": "A / Left Arrow",
        "action": "Turn left"
      },
      {
        "key": "D / Right Arrow",
        "action": "Turn right"
      }
    ]
  },
  {
    "id": "24839",
    "title": "A Day With Masha And The Bear - Fun Together",
    "description": "Wake up to an amazing day filled with fun and learning alongside Masha and her lovable friends! This comprehensive activity collection features over 20 exciting games including bike riding, animal spotting, fishing adventures, checkers matches, and cake baking. Along the way, you'll master important skills like telling time, addition, letter tracing, recycling, and much more. With its diverse educational activities wrapped in entertaining gameplay, this is the ultimate app for Masha and the Bear fans who want to play, learn, and grow!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/naz6nqf341hnw7x7nnfw2u3vh45e437q/",
    "categoryId": "girls",
    "tags": "Adventure, Animal, Casual, Cute, Girl, Girls, H5, HTML5",
    "thumb": "https://img.gamemonetize.com/naz6nqf341hnw7x7nnfw2u3vh45e437q/512x384.jpg",
    "width": "1280",
    "height": "960",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Select activities and interact"
      },
      {
        "key": "Tap Screen",
        "action": "Select activities and interact"
      }
    ]
  },
  {
    "id": "37561",
    "title": "Kitsune Zenko Adventure Game",
    "description": "Join an adorable fox on an epic pixel-art adventure through mystical lands! This charming little kitsune needs your help collecting precious diamonds, shiny coins, and delicious cherries while navigating treacherous platforming challenges. Watch out for dangerous obstacles that lurk around every corner—one wrong move could end your journey! With its retro-inspired graphics and engaging gameplay, this adventure platform game delivers classic fun with modern charm. Guide the fox to victory in this delightful quest!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/2jk2mkem3zsi6o2th0k89wk98l126pjz/",
    "categoryId": "boys",
    "tags": "Adventure, Boy, Boys, Fun, H5, HTML5, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/2jk2mkem3zsi6o2th0k89wk98l126pjz/512x384.jpg",
    "width": "1280",
    "height": "720",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Jump and interact"
      },
      {
        "key": "Tap Screen",
        "action": "Jump and interact"
      }
    ]
  },
  {
    "id": "30168",
    "title": "Stop Them All",
    "description": "Take control of devious traps in this gorgeous casual arcade game with incredibly simple mechanics! Your mission is to activate traps at precisely the right moment to stop characters racing toward the finish line. Timing is everything—tap too early or too late and your targets will slip past your defenses. Focus intensely and develop your sense of perfect timing as levels become progressively more challenging. With its addictive one-button gameplay and satisfying trap mechanics, can you rise to the challenge and stop them all?",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/qotlmbid6lwjfknpkwwjqgvvit3cwpth/",
    "categoryId": "racing",
    "tags": "3D, 3D Games, Boy, Boys, Fun, H5, HTML5, Kid, Kids, running",
    "thumb": "https://img.gamemonetize.com/qotlmbid6lwjfknpkwwjqgvvit3cwpth/512x384.jpg",
    "width": "750",
    "height": "1334",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Activate traps"
      },
      {
        "key": "Tap Screen",
        "action": "Activate traps"
      }
    ]
  },
  {
    "id": "27427",
    "title": "Line Color 3D - Fun & Run 3D Game",
    "description": "Put your reflexes to the test in this captivating 3D arcade runner! Navigate your colored line through a treacherous obstacle course, dodging barriers and hazards while racing to the finish. This challenging game demands quick thinking, precise movements, and unwavering concentration. Every level brings new obstacles to overcome, and only the most skilled players will conquer them all. If you're looking to kill time while testing your limits, Line Color 3D offers endless entertainment and escalating challenges!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/jdkdximy6f88fd7f2014gqyd5c3evfdd/",
    "categoryId": "hypercasual",
    "tags": "3D, 3D Games, Arcade, Boy, Boys, Fun, H5, HTML5, Hypercasual, Kid, Kids, Race, run",
    "thumb": "https://img.gamemonetize.com/jdkdximy6f88fd7f2014gqyd5c3evfdd/512x384.jpg",
    "width": "720",
    "height": "1280",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Stop or release movement"
      },
      {
        "key": "Tap Screen",
        "action": "Stop or release movement"
      }
    ]
  },
  {
    "id": "24648",
    "title": "Masha And The Bear Jigsaw - Puzzles For Kids",
    "description": "Delight young puzzle enthusiasts with this charming collection featuring everyone's favorite adventurous duo! Children love the colorful world of Masha and the Bear, and now they can piece together their favorite scenes from the beloved cartoon series. With age-appropriate difficulty levels and vibrant imagery, this jigsaw game provides hours of educational entertainment. Perfect for developing problem-solving skills, spatial awareness, and patience while enjoying the magical adventures of Masha and her gentle bear friend!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/dignx4a0mc009jxd0i33z75wpjle8nmn/",
    "categoryId": "girls",
    "tags": "Adventure, Animal, Baby, Girl, H5, HTML5, Jigsaw, Music, Puzzle",
    "thumb": "https://img.gamemonetize.com/dignx4a0mc009jxd0i33z75wpjle8nmn/512x384.jpg",
    "width": "720",
    "height": "1280",
    "gameControls": [
      {
        "key": "Mouse Drag",
        "action": "Move puzzle pieces"
      },
      {
        "key": "Tap & Drag",
        "action": "Move puzzle pieces"
      }
    ]
  },
  {
    "id": "28573",
    "title": "Sweet Baby Girl Christmas - Fun Holiday",
    "description": "Discover the magic of Christmas in Santa's enchanted village! Sweet Baby Girl and her best friends are Santa's most adorable helpers this holiday season. Join them for festive fun including baking ginger cookies, dressing up Santa, pampering him at the spa, creating frozen ice sculptures, rescuing Rudolph the reindeer, and so much more! This comprehensive Christmas adventure combines creativity, caring activities, and holiday magic into one delightful package that captures the true spirit of the season!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/6ryfoq09syb2tgyc09gottbwhhxk1hb1/",
    "categoryId": "hypercasual",
    "tags": "Christmas, Cleaning, Decorate, Decoration, Dress Up, Educational, Fun, Girl, Girls, H5, House, HTML5, Hypercasual, Kid, Kids, Makeover",
    "thumb": "https://img.gamemonetize.com/6ryfoq09syb2tgyc09gottbwhhxk1hb1/512x384.jpg",
    "width": "800",
    "height": "504",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Select items and play activities"
      },
      {
        "key": "Tap Screen",
        "action": "Select items and play activities"
      }
    ]
  },
  {
    "id": "32609",
    "title": "Charge Through Racing - Drifting Game",
    "description": "Navigate your fragile vehicle across perilous platforms in this skillful driving challenge! Dangerous obstacles line your path, ready to destroy your car in an instant. Success requires patience, careful observation, and impeccable timing. Study the rhythm of moving hazards, identify safe gaps, and charge through at precisely the right moment. Don't rush—one miscalculation could spell disaster. Master the art of calculated risk-taking and prove you have what it takes to conquer this treacherous racing course!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/oye8z29s4b7s4nqymuklc5noyx0p9jvr/",
    "categoryId": "racing",
    "tags": "Boy, Boys, Car, Crazy, drift, drifting, Driving, Fun, H5, HTML5, Kid, Kids, Race, Racing",
    "thumb": "https://img.gamemonetize.com/oye8z29s4b7s4nqymuklc5noyx0p9jvr/512x384.jpg",
    "width": "1334",
    "height": "750",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Accelerate and drift"
      },
      {
        "key": "Tap Screen",
        "action": "Accelerate and drift"
      }
    ]
  },
  {
    "id": "43144",
    "title": "Money Rich Lover",
    "description": "Experience the exhilarating journey from rags to riches in this addictive parkour adventure! Play as an aspiring millionaire navigating the challenging path to financial success. Dodge tempting distractions like parties and video games that threaten to drain your fortune. Stay focused, make smart choices, and watch your assets grow with every wise decision. Your wealth determines your ultimate destination—will you achieve millionaire status or fall into bankruptcy? Navigate this money-making journey and discover where your financial decisions lead!",
    "instructions": "Tap or click",
    "url": "https://html5.gamemonetize.com/cuphsqorseyag3ymk2xn9okuf9uqkh3i/",
    "categoryId": "girls",
    "tags": "Adventure, Arcade, Funny, Girls",
    "thumb": "https://img.gamemonetize.com/cuphsqorseyag3ymk2xn9okuf9uqkh3i/512x384.jpg",
    "width": "750",
    "height": "1334",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Navigate and make choices"
      },
      {
        "key": "Tap Screen",
        "action": "Navigate and make choices"
      }
    ]
  },
  {
    "id": "29492",
    "title": "Winter Gems 10x10",
    "description": "Match sparkling gems on a frosty 10x10 grid in this pure and addictive puzzle challenge! Success comes from collecting ten matching gems in perfect straight lines—whether horizontal, vertical, or diagonal. Forget about colors and patterns; think strategically and treat each group as building blocks for maximum scores. As an endless game, your goal is to create as many matches as possible before running out of space. How high can you score in this winter wonderland of gem-matching excitement?",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/cu1h5csk09h63jv12tifem98vv7i6hbl/",
    "categoryId": "girls",
    "tags": "Boy, Boys, Brain, Educational, Fun, Girl, Girls, H5, HTML5, Hypercasual, Kid, Kids, Puzzle",
    "thumb": "https://img.gamemonetize.com/cu1h5csk09h63jv12tifem98vv7i6hbl/512x384.jpg",
    "width": "750",
    "height": "1334",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Place and match gems"
      },
      {
        "key": "Tap Screen",
        "action": "Place and match gems"
      }
    ]
  },
  {
    "id": "37331",
    "title": "Giant Rush Online 3D",
    "description": "Embark on the year's most thrilling arcade adventure combining parkour action with epic battles! Collect colorful fruits as you dash across platforms, transforming your character's appearance with each gathered item. Strategically avoid incompatible fruits while racing toward victory. But that's not all—when you're not running, engage in exciting combat against other players! With its unique blend of collection mechanics, obstacle avoidance, and competitive multiplayer action, Giant Rush Online delivers addictive 3D gameplay that keeps you coming back for more!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/zvn8gv24yngpds84lkovxpjc923byhzh/",
    "categoryId": "boys",
    "tags": "3D, 3D Games, Boy, Boys, Fun, H5, HTML5, Hypercasual, Kid, Kids, run, running",
    "thumb": "https://img.gamemonetize.com/zvn8gv24yngpds84lkovxpjc923byhzh/512x384.jpg",
    "width": "750",
    "height": "1334",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Change direction and interact"
      },
      {
        "key": "Tap Screen",
        "action": "Change direction and interact"
      }
    ]
  },
  {
    "id": "32662",
    "title": "Doctor Kids 2 - Doctor Game",
    "description": "Become a compassionate pediatrician and help young patients feel better! Use your medical expertise to check respiratory systems, treat sore throats, eliminate pesky head lice, heal digestive issues, operate advanced MRI scanners, and even pilot emergency helicopters. Each patient presents unique challenges that require careful examination and treatment. Apply your medical skills with precision and spread happiness to sick children who need your care. It's time to don your white coat and make a difference in these little patients' lives!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/9cqnazvygopdztm0b5u3uf64k7o8soa6/",
    "categoryId": "hypercasual",
    "tags": "Doctor, Educational, Fun, Girl, Girls, H5, HTML5, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/9cqnazvygopdztm0b5u3uf64k7o8soa6/512x384.jpg",
    "width": "720",
    "height": "1280",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Use medical tools and treat patients"
      },
      {
        "key": "Tap Screen",
        "action": "Use medical tools and treat patients"
      }
    ]
  },
  {
    "id": "28597",
    "title": "My New Baby Twins - Baby Care Game",
    "description": "Experience the beautiful journey of twin pregnancy and newborn care! Craft adorable matching outfits for your twins, accompany expectant mothers to important medical checkups, and choose stylish maternity clothes that keep moms comfortable and fashionable. Create a soothing environment with relaxing music that both mother and babies will love. This heartwarming game lets you share in the joys and responsibilities of preparing for twins, from pregnancy through those precious first moments. Make every moment magical as you welcome these little princesses into the world!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/kubn1ici2cv67utn76gal1adjd2mgdvi/",
    "categoryId": "girls",
    "tags": "2D, Baby, Educational, Fun, Girl, Girls, H5, HTML5, Hypercasual",
    "thumb": "https://img.gamemonetize.com/kubn1ici2cv67utn76gal1adjd2mgdvi/512x384.jpg",
    "width": "504",
    "height": "800",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Care for babies and interact with items"
      },
      {
        "key": "Tap Screen",
        "action": "Care for babies and interact with items"
      }
    ]
  },
  {
    "id": "39557",
    "title": "Ricochet Arrow: Shooting Game",
    "description": "Grab your bow and prepare for skeletal destruction across 50 increasingly challenging levels! Eliminate dangerous skeletons using your mastery of arrow physics and ricochet shots. You have unlimited arrows at your disposal, but strategy matters—aim carefully and plan your angles to avoid hitting yourself. Bounce arrows off walls, through gaps, and around obstacles to reach your bony targets. With each level presenting new layout challenges, you'll need sharp shooting skills and clever thinking to destroy every skeleton!",
    "instructions": "Tap or click",
    "url": "https://html5.gamemonetize.com/uhh1dsncjak3i9cadbj8tuyfu33tjg7l/",
    "categoryId": "shooting",
    "tags": "Action, Arcade, Boys, Shooting",
    "thumb": "https://img.gamemonetize.com/uhh1dsncjak3i9cadbj8tuyfu33tjg7l/512x384.jpg",
    "width": "1334",
    "height": "750",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Aim and shoot arrows"
      },
      {
        "key": "Tap Screen",
        "action": "Aim and shoot arrows"
      }
    ]
  },
  {
    "id": "43083",
    "title": "Supermarket Dash",
    "description": "Manage the busiest supermarket in town in this fast-paced shopping simulation! Help customers find exactly what they need by quickly gathering items from shelves and processing their purchases at checkout. Speed and efficiency are crucial as shoppers line up with their lists. Successfully serve each customer to collect cash and keep your supermarket running smoothly. With its charming 2D cartoon graphics and engaging time-management gameplay, Supermarket Dash delivers retail therapy at its finest. Can you handle the shopping rush?",
    "instructions": "Tap or click",
    "url": "https://html5.gamemonetize.com/vq21efise3o49rukv6g15qb74t51wjbu/",
    "categoryId": "hypercasual",
    "tags": "Fun, Girls, Hypercasual, Shopping",
    "thumb": "https://img.gamemonetize.com/vq21efise3o49rukv6g15qb74t51wjbu/512x384.jpg",
    "width": "800",
    "height": "504",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Pick items and serve customers"
      },
      {
        "key": "Tap Screen",
        "action": "Pick items and serve customers"
      }
    ]
  },
  {
    "id": "28752",
    "title": "City Constructor Driver 3D - Fun & Run 3D Game",
    "description": "Take the wheel of a heavy-duty construction truck in this immersive 3D simulation! Transport bricks across the bustling city, picking up materials from various locations and delivering them to construction sites. Watch in satisfaction as your deliveries automatically transform into magnificent buildings upon arrival. Speed up the construction process by tapping the screen for bonus productivity. With its charming cartoon graphics and engaging gameplay loop, City Constructor Driver 3D puts you in the driver's seat of urban development!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/4cldesnr7zobgiwqz9nfyiqdew4smtdn/",
    "categoryId": "boys",
    "tags": "3D, 3D Games, Boy, Boys, Car, city, Girl, H5, HTML5, Hypercasual, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/4cldesnr7zobgiwqz9nfyiqdew4smtdn/512x384.jpg",
    "width": "1280",
    "height": "720",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Drive truck and speed up construction"
      },
      {
        "key": "Tap Screen",
        "action": "Drive truck and speed up construction"
      }
    ]
  },
  {
    "id": "75693",
    "title": "Bubble Pet Game",
    "description": "Welcome to a colorful world where adorable pets need your bubble-popping expertise! Match and shoot bubbles with careful aim to clear the board and rescue cute animals in this super fun puzzle adventure. Each level introduces new brain-teasing challenges, fun obstacles, and rewarding surprises that guarantee hours of entertainment. Whether you're a casual gamer, puzzle enthusiast, or pet lover, this delightful bubble shooter delivers bright visuals, relaxing gameplay, and endless charm. Help these precious pets and become the ultimate bubble master!",
    "instructions": "- To click any button use mouse ",
    "url": "https://html5.gamemonetize.com/g4gvh81z7v2ne8bziuh6xrwa43bb8sxd/",
    "categoryId": "puzzles",
    "tags": "2026 games, amazing, Animal, Bubble Shooter, Fun, Puzzle",
    "thumb": "https://img.gamemonetize.com/g4gvh81z7v2ne8bziuh6xrwa43bb8sxd/512x384.jpg",
    "width": "800",
    "height": "600",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Aim and shoot bubbles"
      },
      {
        "key": "Tap Screen",
        "action": "Aim and shoot bubbles"
      }
    ]
  }
]