[
  {
    "id": "37331",
    "title": "Giant Rush Online 3D",
    "description": "Embark on the year's most thrilling arcade adventure combining parkour action with epic battles! Collect colorful fruits as you dash across platforms, transforming your character's appearance with each gathered item. Strategically avoid incompatible fruits while racing toward victory. But that's not all—when you're not running, engage in exciting combat against other players! With its unique blend of collection mechanics, obstacle avoidance, and competitive multiplayer action, Giant Rush Online delivers addictive 3D gameplay that keeps you coming back for more!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/zvn8gv24yngpds84lkovxpjc923byhzh/",
    "categoryId": "boys",
    "tags": "3D, 3D Games, Boy, Boys, Fun, H5, HTML5, Hypercasual, Kid, Kids, run, running",
    "thumb": "https://img.gamemonetize.com/zvn8gv24yngpds84lkovxpjc923byhzh/512x384.jpg",
    "width": "750",
    "height": "1334",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Change direction and interact"
      },
      {
        "key": "Tap Screen",
        "action": "Change direction and interact"
      }
    ]
  },
  {
    "id": "32662",
    "title": "Doctor Kids 2 - Doctor Game",
    "description": "Become a compassionate pediatrician and help young patients feel better! Use your medical expertise to check respiratory systems, treat sore throats, eliminate pesky head lice, heal digestive issues, operate advanced MRI scanners, and even pilot emergency helicopters. Each patient presents unique challenges that require careful examination and treatment. Apply your medical skills with precision and spread happiness to sick children who need your care. It's time to don your white coat and make a difference in these little patients' lives!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/9cqnazvygopdztm0b5u3uf64k7o8soa6/",
    "categoryId": "hypercasual",
    "tags": "Doctor, Educational, Fun, Girl, Girls, H5, HTML5, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/9cqnazvygopdztm0b5u3uf64k7o8soa6/512x384.jpg",
    "width": "720",
    "height": "1280",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Use medical tools and treat patients"
      },
      {
        "key": "Tap Screen",
        "action": "Use medical tools and treat patients"
      }
    ]
  },
  {
    "id": "28597",
    "title": "My New Baby Twins - Baby Care Game",
    "description": "Experience the beautiful journey of twin pregnancy and newborn care! Craft adorable matching outfits for your twins, accompany expectant mothers to important medical checkups, and choose stylish maternity clothes that keep moms comfortable and fashionable. Create a soothing environment with relaxing music that both mother and babies will love. This heartwarming game lets you share in the joys and responsibilities of preparing for twins, from pregnancy through those precious first moments. Make every moment magical as you welcome these little princesses into the world!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/kubn1ici2cv67utn76gal1adjd2mgdvi/",
    "categoryId": "girls",
    "tags": "2D, Baby, Educational, Fun, Girl, Girls, H5, HTML5, Hypercasual",
    "thumb": "https://img.gamemonetize.com/kubn1ici2cv67utn76gal1adjd2mgdvi/512x384.jpg",
    "width": "504",
    "height": "800",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Care for babies and interact with items"
      },
      {
        "key": "Tap Screen",
        "action": "Care for babies and interact with items"
      }
    ]
  },
  {
    "id": "39557",
    "title": "Ricochet Arrow: Shooting Game",
    "description": "Grab your bow and prepare for skeletal destruction across 50 increasingly challenging levels! Eliminate dangerous skeletons using your mastery of arrow physics and ricochet shots. You have unlimited arrows at your disposal, but strategy matters—aim carefully and plan your angles to avoid hitting yourself. Bounce arrows off walls, through gaps, and around obstacles to reach your bony targets. With each level presenting new layout challenges, you'll need sharp shooting skills and clever thinking to destroy every skeleton!",
    "instructions": "Tap or click",
    "url": "https://html5.gamemonetize.com/uhh1dsncjak3i9cadbj8tuyfu33tjg7l/",
    "categoryId": "shooting",
    "tags": "Action, Arcade, Boys, Shooting",
    "thumb": "https://img.gamemonetize.com/uhh1dsncjak3i9cadbj8tuyfu33tjg7l/512x384.jpg",
    "width": "1334",
    "height": "750",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Aim and shoot arrows"
      },
      {
        "key": "Tap Screen",
        "action": "Aim and shoot arrows"
      }
    ]
  },
  {
    "id": "43083",
    "title": "Supermarket Dash",
    "description": "Manage the busiest supermarket in town in this fast-paced shopping simulation! Help customers find exactly what they need by quickly gathering items from shelves and processing their purchases at checkout. Speed and efficiency are crucial as shoppers line up with their lists. Successfully serve each customer to collect cash and keep your supermarket running smoothly. With its charming 2D cartoon graphics and engaging time-management gameplay, Supermarket Dash delivers retail therapy at its finest. Can you handle the shopping rush?",
    "instructions": "Tap or click",
    "url": "https://html5.gamemonetize.com/vq21efise3o49rukv6g15qb74t51wjbu/",
    "categoryId": "hypercasual",
    "tags": "Fun, Girls, Hypercasual, Shopping",
    "thumb": "https://img.gamemonetize.com/vq21efise3o49rukv6g15qb74t51wjbu/512x384.jpg",
    "width": "800",
    "height": "504",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Pick items and serve customers"
      },
      {
        "key": "Tap Screen",
        "action": "Pick items and serve customers"
      }
    ]
  },
  {
    "id": "28752",
    "title": "City Constructor Driver 3D - Fun & Run 3D Game",
    "description": "Take the wheel of a heavy-duty construction truck in this immersive 3D simulation! Transport bricks across the bustling city, picking up materials from various locations and delivering them to construction sites. Watch in satisfaction as your deliveries automatically transform into magnificent buildings upon arrival. Speed up the construction process by tapping the screen for bonus productivity. With its charming cartoon graphics and engaging gameplay loop, City Constructor Driver 3D puts you in the driver's seat of urban development!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/4cldesnr7zobgiwqz9nfyiqdew4smtdn/",
    "categoryId": "boys",
    "tags": "3D, 3D Games, Boy, Boys, Car, city, Girl, H5, HTML5, Hypercasual, Kid, Kids",
    "thumb": "https://img.gamemonetize.com/4cldesnr7zobgiwqz9nfyiqdew4smtdn/512x384.jpg",
    "width": "1280",
    "height": "720",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Drive truck and speed up construction"
      },
      {
        "key": "Tap Screen",
        "action": "Drive truck and speed up construction"
      }
    ]
  },
  {
    "id": "75693",
    "title": "Bubble Pet Game",
    "description": "Welcome to a colorful world where adorable pets need your bubble-popping expertise! Match and shoot bubbles with careful aim to clear the board and rescue cute animals in this super fun puzzle adventure. Each level introduces new brain-teasing challenges, fun obstacles, and rewarding surprises that guarantee hours of entertainment. Whether you're a casual gamer, puzzle enthusiast, or pet lover, this delightful bubble shooter delivers bright visuals, relaxing gameplay, and endless charm. Help these precious pets and become the ultimate bubble master!",
    "instructions": "- To click any button use mouse ",
    "url": "https://html5.gamemonetize.com/g4gvh81z7v2ne8bziuh6xrwa43bb8sxd/",
    "categoryId": "puzzles",
    "tags": "2026 games, amazing, Animal, Bubble Shooter, Fun, Puzzle",
    "thumb": "https://img.gamemonetize.com/g4gvh81z7v2ne8bziuh6xrwa43bb8sxd/512x384.jpg",
    "width": "800",
    "height": "600",
    "gameControls": [
      {
        "key": "Mouse Click",
        "action": "Aim and shoot bubbles"
      },
      {
        "key": "Tap Screen",
        "action": "Aim and shoot bubbles"
      }
    ]
  }
]